Config/Documents/ПередачаГруппОбъектовИК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПередачаГруппОбъектовИК</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СтоимостьОбъектовОС</xr:Item>
				<xr:Item>InformationRegister.СобытияОС</xr:Item>
				<xr:Item>AccumulationRegister.АмортизацияОбъектовОС</xr:Item>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
				<xr:Item>AccumulationRegister.СтоимостьОбъектовОСПоКонтрагентам</xr:Item>
				<xr:Item>AccumulationRegister.ОборотыРасчетовСУчредителями</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеДляАкта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОснованияДляАкта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОснованияДляАкта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФамилияПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчествоПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РеквизитыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приложение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСписанияСБухУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДИсточника</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПередачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийИК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОсновныеСредства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвентарныйНомер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнвентарныеНомераОС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>Балансовая стоимость 1 единицы</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАмортизации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставКомиссии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДолжностьЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФамилияЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтчествоЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Enums/ВидыНФА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыНФА</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НМА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НПА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КапВложения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПраваПользованияИмуществом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Казна</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ВидыОперацийИК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийИК</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятиеКУчетуИзготовление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратУправление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратАренда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратБезвозмездноеПользование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Передача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаУправление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаАренда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаБезмозмездноеПользование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реализация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеЗабаланс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаИКПолученныхВПользование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаОСнаХранении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаКапвложений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеИКНаБалансе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеИКПолученноеВПользование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеИКнаХранении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаИКвФинансовуюАренду</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаЗемУчастковВПользование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗемУчастковИзПользования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеКапвложенийВИК</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/СостоянияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияОС</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятоКУчету</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВведеноВЭксплуатацию</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятоСУчета</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/КВД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>КВД</Name>
			<Comment>Коды финансового обеспечения</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Бюджет</Name>
					<Comment>Деятельность, осуществляемая за счет средств соответствующего бюджета бюджетной системы Российской Федерации (бюджетная деятельность)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внебюджет</Name>
					<Comment>Приносящая доход деятельность (собственные доходы учреждения)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВременноеРаспоряжение</Name>
					<Comment>Средства во временном распоряжении</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СубсидииНаГосзадание</Name>
					<Comment>Деятельность по выполнению государственного (муниципального) задания</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СубсидииНаИныеЦели</Name>
					<Comment>Деятельность, осуществляемая за счет средств субсидии на иные цели, грантов в форме субсидий</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БюджетныеИнвестиции</Name>
					<Comment>Деятельность, осуществляемая за счет средств субсидии на цели осуществления капитальных вложений</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СредстваОМС</Name>
					<Comment>Деятельность, осуществляемая по обязательному медицинскому страхованию</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/ПередачаГруппОбъектовИК/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем ВыборОСОбработан;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	УправлениеНФА.ПроверитьУчетИмуществаКазны();

	ОбщегоНазначенияБГУ.УстановитьНедоступныеЭлементыФормы(Элементы, Объект, "ОсновныеСредстваПодборОС"
																			+",ВыбратьКомиссию"
																			+",ВыбратьПредседателяКомиссии"
																			+",СоставКомиссииПодобратьСотрудников");
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	// если документ скопирован или введен на основании, то чтения на сервере не было
	Если Параметры.Ключ.Пустая() И Объект.ОсновныеСредства.Количество() > 0 Тогда
		УстановитьГрупповойУчет();
	КонецЕсли;
	
	Элементы.Подразделение.АвтоОтметкаНезаполненного = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям")
														И БухгалтерскийУчетПовтИсп.ПолучитьПризнакиУчета("108.00").УчетПоПодразделениям;
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.КФО = ДоступныйКФО(Объект.Организация, Объект.ИФО, Объект.Дата);
		УстановитьДоступностьСвязанныхРеквизитовВидПередачи(ЭтаФорма, Объект);
		УстановитьДоступностьСвязанныхРеквизитовОрганизации(ЭтаФорма, Объект);
		УстановитьДоступностьДоговора(ЭтаФорма, Объект);
	КонецЕсли;
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства

	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеОсновнымиСредствамиКлиент.ПриОткрытииДокумента173н(ЭтотОбъект, "ПередачаОбъектовИК");
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения

	УстановитьГрупповойУчет();
	УстановитьДоступностьСвязанныхРеквизитовВидПередачи(ЭтаФорма, Объект);
	УстановитьДоступностьСвязанныхРеквизитовОрганизации(ЭтаФорма, Объект);
	УстановитьДоступностьДоговора(ЭтаФорма, Объект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма);
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтаФорма);
    Оповестить("ДокументыПоУчетуИКИзменение");
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если Лев(ИсточникВыбора.ИмяФормы,40) = "Справочник.ПостоянноДействующиеКомиссии." Тогда
		УправлениеОсновнымиСредствамиКлиент.УстановитьКомиссиюВДокументОС(ВыбранноеЗначение, Объект, ЭтаФорма);
	ИначеЕсли Лев(ИсточникВыбора.ИмяФормы,22) = "Справочник.Сотрудники." Тогда
		УправлениеОсновнымиСредствамиКлиент.ОбработатьВыборПредседателяКомиссии(ЭтаФорма,
																				ВыбранноеЗначение, 
																				, 
																				Объект.ДолжностьПредседателяКомиссии,
																				Объект.ФамилияПредседателяКомиссии,
																				Объект.ИмяПредседателяКомиссии,
																				Объект.ОтчествоПредседателяКомиссии);
	ИначеЕсли СтрНачинаетсяС(ИсточникВыбора.ИмяФормы, "Обработка.ПодборОсновныхСредств") Тогда
		ОбработкаВыбораПодбораОССервер(ВыбранноеЗначение);
	КонецЕсли;
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

    // Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части

	УстановитьГрупповойУчет();
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидПередачиПриИзменении(Элемент)
	УстановитьДоступностьСвязанныхРеквизитовВидПередачи(ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	// Дальнейшая обработка изменения даты выполняется в процедурах ДатаПриИзмененииНаКлиенте и ДатаПриИзмененииНаСервере.
	// Код, размещенный здесь, может работать неправильно, т.к. пользователь мог отказаться от изменения даты.
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		ДатаПриИзмененииНаСервере();
	КонецЕсли;
	
	УправлениеОсновнымиСредствамиКлиент.ЗапроситьИзменениеДатыСписанияСБухУчета(Объект);
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		
		ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
		
		Объект.КФО = ДоступныйКФО(Объект.Организация, Объект.ИФО, Объект.Дата);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
	УстановитьДоступностьСвязанныхРеквизитовОрганизации(ЭтаФорма, Объект);
	УстановитьДоступностьДоговора(ЭтаФорма, Объект);
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
	Объект.КФО = ДоступныйКФО(Объект.Организация, Объект.ИФО, Объект.Дата);
	
КонецПроцедуры

&НаКлиенте
Процедура ИФОПриИзменении(Элемент)
	
	ИФОПриИзмененииНаСервере();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ИФОПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	УстановитьДоступностьДоговора(ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура КПСПриИзменении(Элемент)
	ОбнулитьСуммы();
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////////////
//               ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ТИПОВЫХ ОПЕРАЦИЙ                       //

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтаФорма.Элементы[ИмяЭлемента]);	

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент)

	БухгалтерскиеОперацииКлиент.ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтаФорма, Команда);	

КонецПроцедуры 

//               ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ТИПОВЫХ ОПЕРАЦИЙ                       //
/////////////////////////////////////////////////////////////////////////////////////////

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОсновныеСредства

&НаКлиенте
Процедура ОсновныеСредстваПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекстСообщения = НСтр("ru='Поле ""Организация"" не заполнено'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Объект.Организация",,Отказ);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваОсновноеСредствоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	
	Если ЭтотОбъект.КэшПараметров.УчетнаяПолитика.ВедениеАналитическогоУчетаИмуществаКазны
		И ЗначениеЗаполнено(ТекущиеДанные.ОсновноеСредство) И НЕ ЗначениеЗаполнено(ТекущиеДанные.ИнвентарныйНомер) Тогда
		ТекущиеДанные.ИнвентарныйНомер = ПолучитьИнвентарныйНомер(ТекущиеДанные.ОсновноеСредство, Объект.Дата, ТекущиеДанные.ГрупповойУчет);
	КонецЕсли;
	
	РассчитатьСуммы(ТекущиеДанные);
	ВыборОСОбработан = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваОсновноеСредствоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВыборОСОбработан = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваОсновноеСредствоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СоответствиеРеквизитов = Новый Соответствие;
	СоответствиеРеквизитов.Вставить("ГрупповойУчет", "ГрупповойУчет");
	СоответствиеРеквизитов.Вставить("ИнвентарныйНомер", "ИнвентарныйНомер");
	УправлениеОсновнымиСредствамиКлиент.ОбработкаВыбораОсновногоСредства(ВыбранноеЗначение, Новый Структура("Форма", ТекущиеДанные), СоответствиеРеквизитов, ВыборОСОбработан);
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваИнвентарныйНомерПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	РассчитатьСуммы(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваКоличествоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваЦенаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если Не НоваяСтрока Тогда
		УстановитьДоступностьКоличества(Элементы.ОсновныеСредства.ТекущиеДанные);		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСоставКомиссии

&НаКлиенте
Процедура СоставКомиссииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УправлениеОсновнымиСредствамиКлиент.ОбработатьПодборКомиссии(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаРассчитатьСтоимостьОС(Команда)
	Если ОбщегоНазначенияБГУКлиентСервер.ПроверитьЗаполнениеРеквизитов(СформироватьСтруктуруПроверяемыхРеквизитов(УчитываетсяПодразделение(Объект.ВидПередачи)),Объект,Истина) Тогда
		Возврат;
	КонецЕсли;
	РассчитатьСтоимостьОС();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКомиссию(Команда)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Владелец", Объект.Организация));
		ОткрытьФорму("Справочник.ПостоянноДействующиеКомиссии.ФормаВыбора", ПараметрыФормы, ЭтаФорма);	
	Иначе
		ПоказатьПредупреждение(Неопределено, НСтр("ru='Сначала необходимо выбрать организацию'"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьСотрудников(Команда)
	УправлениеОсновнымиСредствамиКлиент.ОткрытьПодборКомиссии(Элементы.СоставКомиссии, Объект.Организация, Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПредседателяКомиссии(Команда)
	УправлениеОсновнымиСредствамиКлиент.ОткрытьВыборПредседателяКомиссии(ЭтаФорма, Объект.Организация, Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ПодборОС(Команда)
	Перем СтруктураПараметровПодбора;
	
	УправлениеОсновнымиСредствамиКлиент.ОткрытьПодборОсновныхСредств(ЭтаФорма, Объект);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДополнитьПараметрыПодбора(ПараметрыПодбора) Экспорт

	ПараметрыПодбора.Вставить("Казна", 					Истина);
	ПараметрыПодбора.Вставить("ТребуемыеДанные",		"ГрупповойУчет,СчетУчета,Цена");
	
	ПараметрыПодбора.Вставить("ПоказыватьОстатки",		Истина);
	ПараметрыПодбора.Вставить("ЕстьИнвентарныйНомер",
		ЭтотОбъект.КэшПараметров.УчетнаяПолитика.ВедениеАналитическогоУчетаИмуществаКазны);
	ПараметрыПодбора.Отбор.Вставить("КФО",				Объект.КФО);
	ПараметрыПодбора.Отбор.Вставить("КПС",				Объект.КПС);
	ПараметрыПодбора.Отбор.Вставить("ИФО",				Объект.ИФО);
	ПараметрыПодбора.Отбор.Вставить("Подразделение",	Объект.Подразделение);
	
	Если Объект.ОсновныеСредства.Количество() > 0 Тогда
		ПараметрыПодбора.Вставить("АдресОСВХранилище", ПоместитьОСВХранилище());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СтруктураПроверяемыхРеквизитов() Экспорт

	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("ВидПередачи", НСтр("ru='Вид передачи'"));
	СтруктураРеквизитов.Вставить("Организация");
	Если ОбщегоНазначенияБГУВызовСервераПовтИсп.ЗначениеФункциональнойОпции("ИспользоватьУчетПоИФО") Тогда
		СтруктураРеквизитов.Вставить("ИФО");
	КонецЕсли;
	Если УчитываетсяПодразделение(Объект.ВидПередачи) Тогда
		СтруктураРеквизитов.Вставить("Подразделение");
	КонецЕсли;
	СтруктураРеквизитов.Вставить("КФО");
	СтруктураРеквизитов.Вставить("КПС");
	
    Возврат СтруктураРеквизитов;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СформироватьСтруктуруПроверяемыхРеквизитов(ВключатьПодразделение=Ложь)
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("ВидПередачи", НСтр("ru='Вид передачи'"));
	СтруктураРеквизитов.Вставить("Организация");
	Если ОбщегоНазначенияБГУВызовСервераПовтИсп.ЗначениеФункциональнойОпции("ИспользоватьУчетПоИФО") Тогда
		СтруктураРеквизитов.Вставить("ИФО");
	КонецЕсли;
	Если ВключатьПодразделение Тогда
		СтруктураРеквизитов.Вставить("Подразделение");
	КонецЕсли;
	СтруктураРеквизитов.Вставить("КФО");
	СтруктураРеквизитов.Вставить("КПС");
	
    Возврат СтруктураРеквизитов;
КонецФункции

&НаСервере
Функция ПоместитьОСВХранилище()

	ТаблицаОС = Объект.ОсновныеСредства.Выгрузить();
	Возврат ПоместитьВоВременноеХранилище(ТаблицаОС);

КонецФункции

&НаСервере
Процедура ОбработкаВыбораПодбораОССервер(Знач ВыбранноеЗначение)
	ДобавленныеСтроки = УправлениеОсновнымиСредствами.ОбработатьПодборОсновныхСредств(Объект.ОсновныеСредства,ВыбранноеЗначение,,"ОсновноеСредство,ИнвентарныйНомер");
	
	Для каждого ЭлементКоллекции Из Объект.ОсновныеСредства Цикл
		
		Элементы.ОсновныеСредстваКоличество.ТолькоПросмотр = НЕ ЭлементКоллекции.ГрупповойУчет И НЕ ЭлементКоллекции.ВидНФА = Перечисления.ВидыНФА.КапВложения;
		Если НЕ ЭлементКоллекции.ГрупповойУчет И НЕ ЭлементКоллекции.ВидНФА = Перечисления.ВидыНФА.КапВложения И ЭлементКоллекции.Количество<>1 Тогда
			ЭлементКоллекции.Количество = 1;
		КонецЕсли;

		//РассчитатьБалансовуюСтоимостьИАмортизацию(ЭлементКоллекции.ОсновноеСредство, ЭлементКоллекции.ИнвентарныйНомер,  ЭлементКоллекции.Сумма, ЭлементКоллекции.СуммаАмортизации, ЭлементКоллекции.Количество, ЭлементКоллекции.Цена);
		//		
	КонецЦикла;
	
	РассчитатьСтоимостьОС();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьСвязанныхРеквизитовОрганизации(Форма, Объект)

	Элементы = Форма.Элементы;
	ТолькоПросмотр = Форма.ТолькоПросмотр = ИСТИНА;
	
	ДоступностьРеквизитов = ЗначениеЗаполнено(Объект.Организация);
	Элементы.РеквизитыЛицевогоСчета.Доступность				= ДоступностьРеквизитов;
	Элементы.Подразделение.Доступность						= ДоступностьРеквизитов;
	Элементы.ОсновныеСредстваПодборОС.Доступность			= ДоступностьРеквизитов И НЕ ТолькоПросмотр;
	Элементы.ВыбратьКомиссию.Доступность					= ДоступностьРеквизитов И НЕ ТолькоПросмотр;
	Элементы.ВыбратьПредседателяКомиссии.Доступность		= ДоступностьРеквизитов И НЕ ТолькоПросмотр;
	Элементы.СоставКомиссииПодобратьСотрудников.Доступность	= ДоступностьРеквизитов И НЕ ТолькоПросмотр;
	
КонецПроцедуры // УстановитьДоступностьСвязанныхРеквизитовОрганизации()

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьСвязанныхРеквизитовВидПередачи(Форма, Объект)
	
	Элементы = Форма.Элементы;
	
	ЭтоПередача = Объект.ВидПередачи = ПредопределенноеЗначение("Перечисление.ВидыОперацийИК.Передача");
	Если ЭтоПередача Тогда
		Элементы.Контрагент.АвтоОтметкаНезаполненного	= Ложь;
		Элементы.Контрагент.ОтметкаНезаполненного		= Ложь;
	Иначе
		Элементы.Контрагент.АвтоОтметкаНезаполненного	= Истина;
		Элементы.Контрагент.ОтметкаНезаполненного		= Не ЗначениеЗаполнено(Объект.Контрагент);
	КонецЕсли;

КонецПроцедуры // УстановитьДоступностьСвязанныхРеквизитовВидПередачи()

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьДоговора(Форма, Объект)
	
	Элементы = Форма.Элементы;
	
	Элементы.Договор.Доступность = ЗначениеЗаполнено(Объект.Организация) И ЗначениеЗаполнено(Объект.Контрагент);	

КонецПроцедуры // УстановитьДоступностьДоговора()

&НаКлиенте
Процедура ОбнулитьСуммы()

	Для каждого ТекСтр Из Объект.ОсновныеСредства Цикл
	
		ТекСтр.Цена = 0;
		ТекСтр.Сумма = 0;
	
	КонецЦикла; 

КонецПроцедуры // ОбнулитьСуммы()

&НаКлиенте
Процедура РассчитатьСуммы(ТекущиеДанные, СообщатьОбОшибках = Ложь)
	Если ОбщегоНазначенияБГУКлиентСервер.ПроверитьЗаполнениеРеквизитов(СформироватьСтруктуруПроверяемыхРеквизитов(УчитываетсяПодразделение(Объект.ВидПередачи)),Объект,СообщатьОбОшибках) Тогда
		Возврат;
	КонецЕсли;
	РассчитатьСтоимостьОС(ТекущиеДанные.ПолучитьИдентификатор());
КонецПроцедуры // РассчитатьСуммы()
 
&НаСервере
Процедура РассчитатьСтоимостьОС(Знач ТекущиеДанные = Неопределено)
	
	ПараметрыЗапроса = Новый Структура("Организация, ИФО, КПС, КФО, Подразделение");
	ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, Объект);
	Если Объект.ВидПередачи = Перечисления.ВидыОперацийИК.Передача Тогда
		ПараметрыЗапроса.Вставить("Период", УправлениеОсновнымиСредствамиКлиентСервер.ПериодПолученияОстатковДляДокумента(Объект, Объект.ДатаСписанияСБухУчета));
	Иначе
		ПараметрыЗапроса.Вставить("Период", УправлениеОсновнымиСредствамиКлиентСервер.ПериодПолученияОстатковДляДокумента(Объект));
	КонецЕсли;
	ТаблицаОстатков = УправлениеОсновнымиСредствами.ОстаткиИмуществаКазны(ПараметрыЗапроса, Объект.ОсновныеСредства.Выгрузить(,"НомерСтроки, ОсновноеСредство, ИнвентарныйНомер"));
	
	Для каждого ТекСтр Из Объект.ОсновныеСредства Цикл
	
		СтрокаОстатков = ТаблицаОстатков.Найти(ТекСтр.НомерСтроки, "НомерСтроки");
		ТекСтр.Цена = СтрокаОстатков.СтоимостьЕдиницы;
		Если ЗначениеЗаполнено(ТекСтр.ИнвентарныйНомер) Тогда
			ТекСтр.Количество = 1;
		ИначеЕсли Не ЗНачениеЗаполнено(ТекСтр.Количество) Тогда
			ТекСтр.Количество = СтрокаОстатков.КоличествоВсего;
		КонецЕсли;
		Если ТекСтр.Количество = СтрокаОстатков.КоличествоВсего Тогда
			ТекСтр.Сумма			= СтрокаОстатков.СуммаВсего;
			ТекСтр.СуммаАмортизации = СтрокаОстатков.АмортизацияВсего;
		Иначе
			ТекСтр.Сумма			= СтрокаОстатков.СтоимостьЕдиницы	* ТекСтр.Количество;
			ТекСтр.СуммаАмортизации = СтрокаОстатков.АмортизацияЕдиницы	* ТекСтр.Количество;
		КонецЕсли;
	
	КонецЦикла; 
	
КонецПроцедуры // РассчитатьСтоимостьОС()

&НаСервереБезКонтекста
Функция ПолучитьИнвентарныйНомер(ОсновноеСредство, Период, ГрупповойУчет)
    ГрупповойУчет =  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОсновноеСредство, "ГрупповойУчет");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	МестонахождениеОССрезПоследних.ИнвНомер
	               |ИЗ
	               |	РегистрСведений.МестонахождениеОС.СрезПоследних(
	               |			&Период,
	               |			ОсновноеСредство = &ОсновноеСредство
	               |				И Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияОС.СнятоСУчета)) КАК МестонахождениеОССрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИнвентарныеНомераОС КАК ИнвентарныеНомераОС
	               |		ПО МестонахождениеОССрезПоследних.ИнвНомер = ИнвентарныеНомераОС.Ссылка
	               |			И МестонахождениеОССрезПоследних.ОсновноеСредство = ИнвентарныеНомераОС.ОС
	               |			И МестонахождениеОССрезПоследних.Организация = ИнвентарныеНомераОС.Владелец
	               |ГДЕ
	               |	НЕ ИнвентарныеНомераОС.ПометкаУдаления";
	Запрос.УстановитьПараметр("ОсновноеСредство", 	ОсновноеСредство);
	Запрос.УстановитьПараметр("Период",				Период);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Справочники.ИнвентарныеНомераОС.ПустаяСсылка();
	Иначе
		Выборка = Результат.Выбрать();
		Если выборка.Количество() = 1 Тогда
			Выборка.Следующий();
			Возврат Выборка.ИнвНомер;
		Иначе
			Возврат Справочники.ИнвентарныеНомераОС.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;		

КонецФункции // ПолучитьИнвентарныйНомер()

&НаКлиенте
Процедура УстановитьДоступностьКоличества(ТекущиеДанные)

	//Элементы.ОсновныеСредстваКоличество.ТолькоПросмотр = НЕ ТекущиеДанные.ГрупповойУчет И Объект.ВидУчета <> 4;
	//Если НЕ ТекущиеДанные.ГрупповойУчет И Объект.ВидУчета <> 4 И ТекущиеДанные.Количество<>1 Тогда
	//	ТекущиеДанные.Количество = 1;
	//КонецЕсли;

КонецПроцедуры // УстановитьДоступностьКоличества()

&НаСервере
Процедура УстановитьГрупповойУчет()

	СведенияОбОС = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(Объект.ОсновныеСредства.Выгрузить().ВыгрузитьКолонку("ОсновноеСредство"), "ГрупповойУчет");
	
	Для каждого ТекСтрОС Из Объект.ОсновныеСредства Цикл
		ТекОС = СведенияОбОС[ТекСтрОС.ОсновноеСредство];
		Если ТекОС <> Неопределено Тогда
			ТекСтрОС.ГрупповойУчет 	= ТекОС.ГрупповойУчет;
		КонецЕсли;
	КонецЦикла; 

КонецПроцедуры // УстановитьГрупповойУчет()

&НаСервереБезКонтекста
Функция ДоступныйКФО(Организация, ИФО, Знач Дата)
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
	#Если Сервер Тогда		
	Дата = ТекущаяДатаСеанса();
	#Иначе
	Дата = ТекущаяДата();
	#КонецЕсли
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Возврат ПредопределенноеЗначение("Перечисление.КВД.ПустаяСсылка");
	КонецЕсли;
	
	КФОПоУчетнойПолитике = БухгалтерскийУчетПовтИсп.КФОПоУчетнойПолитике(
		Организация, ИФО, БухгалтерскийУчет.ДатаУстановкиУчетнойПолитики(Организация, Дата));
	
	Если КФОПоУчетнойПолитике.Найти(ПредопределенноеЗначение("Перечисление.КВД.Бюджет"))<>Неопределено Тогда
		Возврат ПредопределенноеЗначение("Перечисление.КВД.Бюджет");
	Иначе
		Возврат ПредопределенноеЗначение("Перечисление.КВД.ПустаяСсылка");
	КонецЕсли;

КонецФункции // ДоступныйКФО()

&НаКлиентеНаСервереБезКонтекста
Функция УчитываетсяПодразделение(ВидПередачи)

	ИспользоватьПодразделение = Ложь;
	Если ОбщегоНазначенияБГУВызовСервераПовтИсп.ЗначениеФункциональнойОпции("ИспользоватьУчетПоПодразделениям") Тогда
		Если ВидПередачи = ПредопределенноеЗначение("Перечисление.ВидыОперацийИК.Передача") Тогда
			ИспользоватьПодразделение = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьПризнакиУчета("108.00").УчетПоПодразделениям;
		ИначеЕсли ВидПередачи = ПредопределенноеЗначение("Перечисление.ВидыОперацийИК.ПередачаАренда") Тогда
			ИспользоватьПодразделение = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьПризнакиУчета("25").УчетПоПодразделениям;
		ИначеЕсли ВидПередачи = ПредопределенноеЗначение("Перечисление.ВидыОперацийИК.ПередачаБезмозмездноеПользование") Тогда
			ИспользоватьПодразделение = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьПризнакиУчета("26").УчетПоПодразделениям;
		КонецЕсли;
	КонецЕсли;
	Возврат ИспользоватьПодразделение;

КонецФункции // УчитываетсяПодразделение()
	
#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
